Catalogs/рс_Процессы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>рс_Процессы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектРС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.рс_Объекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>рс_Действия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>рс_Действие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.рс_Действия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>рс_Реквизит</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.рс_Реквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.рс_СостоянияОбъекта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/рс_Объекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>рс_Объекты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.рс_ВидОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.рс_Разделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектБД</Name>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>рс_Реквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>рс_ТабличнаяЧасть</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.рс_ТабличныеЧасти</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.рс_Реквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>рс_Формы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>рс_Форма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.рс_Формы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Модули</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>рс_Модуль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.рс_Модули</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расширения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Модуль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.рс_Модули</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процедура</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Детализация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.рс_ПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/рс_Процессы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбъектРСПриИзменении(Элемент)
	ОчиститьНедопустимыеРеквизитыДействийНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура рс_Действиярс_РеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.ОбъектРС) Тогда
		ПоказатьПредупреждение(, "Сначала выберите объект.");
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	СписокРеквизитов = РеквизитыОбъектаРСДляВыбораНаСервере(Объект.ОбъектРС);
	
	Если СписокРеквизитов.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "У выбранного объекта нет реквизитов в табличной части «Реквизиты».");
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	ДанныеВыбора = СписокРеквизитов;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНедопустимыеРеквизитыДействийНаСервере()
	
	ДопустимыеРеквизиты = РеквизитыОбъектаРСДляВыбораНаСервере(Объект.ОбъектРС);
	ДопустимыеСсылки = Новый Соответствие;
	
	Для Каждого ЭлементСписка Из ДопустимыеРеквизиты Цикл
		ДопустимыеСсылки.Вставить(ЭлементСписка.Значение, Истина);
	КонецЦикла;
	
	Для Каждого СтрокаДействия Из Объект.рс_Действия Цикл
		Если ЗначениеЗаполнено(СтрокаДействия.рс_Реквизит)
			И ДопустимыеСсылки.Получить(СтрокаДействия.рс_Реквизит) = Неопределено Тогда
			СтрокаДействия.рс_Реквизит = Справочники.рс_Реквизиты.ПустаяСсылка();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция РеквизитыОбъектаРСДляВыбораНаСервере(ОбъектРС)
	
	СписокРеквизитов = Новый СписокЗначений;
	
	Если Не ЗначениеЗаполнено(ОбъектРС) Тогда
		Возврат СписокРеквизитов;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	рс_ОбъектыРеквизиты.Имя КАК Реквизит
		|ИЗ
		|	Справочник.рс_Объекты.рс_Реквизиты КАК рс_ОбъектыРеквизиты
		|ГДЕ
		|	рс_ОбъектыРеквизиты.Ссылка = &ОбъектРС
		|	И рс_ОбъектыРеквизиты.Имя <> ЗНАЧЕНИЕ(Справочник.рс_Реквизиты.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ОбъектРС", ОбъектРС);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокРеквизитов.Добавить(Выборка.Реквизит, Строка(Выборка.Реквизит));
	КонецЦикла;
	
	Возврат СписокРеквизитов;
	
КонецФункции
